{
  "components": [
    {
      "name": "PlainText",
      "props": {
        "id": "experience",
        "title": "Experience",
        "text": [
          {
            "title": "Indepth Solutions",
            "subTitle": "Lead Software Engineer | July, 2023 - PRESENT",
            "text": [
              "Indepth Solutions are developing products that automate administrative tasks for local businesses by integrating AI into their workflow.",
              "Led a team of engineers in the development of 2 company products and 3 separate implementations with clients.",
              "Designed a package management system that allows the team to store more than 80% of the code as reusable packages and optimizes the work of the developers by 50%.",
              "Developed a server architecture for handling sensitive information through API requests and SMPT requests for 3 client implementations",
              "Javascript, Typescript, React, Svelte, Storybook, Jest, GraphQL, Node.js, Express, Neo4j, dGraph, Google App Scripts, C#, Linux Server Administration"
            ]
          },
          {
            "title": "Clustermarket",
            "subTitle": "Software Engineer | February, 2022 - July, 2023",
            "text": [
              "Clustermarket is a startup that develops booking software, which is used in laboratories at universities and pharmaceutical companies.",
              "Migrated a booking software from its initial Ruby-based structure to a Svelte and GraphQL framework, scaling up the product to 40k active users per day in 5k labs.",
              "Implemented 2 new features, on which 30% of the software's functionality relies. Developed 3 low-level tools to handle URL parameters, data filtration, and search querying.",
              "Participated in the development of 30% of the front-end architecture, implemented Storybook and unit testing with Jest, and introduced common design patterns for building components.",
              "Svelte, GraphQL, Storybook, Jest, Gitlab, Ruby"
            ]
          },
          {
            "title": "LimeChain",
            "subTitle": "Software Engineer | November, 2020 - November, 2021",
            "text": [
              "At LimeChain, our focus was pioneering web3 solutions.",
              "Developed the interface of 5 separate client implementations utilizing blockchain technology with React.js.",
              "Contributed to elevating the standard for FE implementations in the company by introducing advanced animations and transitions designed to improve the user experience in 3 projects.",
              "Developed the architecture for the user flow of a platform with over $2'000'000 of total value locked, allowing the support of social media, NFT minting, and auctions.",
              "JavaScript, React, Solidity, Sass"
            ]
          },
          {
            "title": "Grind Web Studio",
            "subTitle": "Front-end Developer | November, 2019 - November, 2020",
            "text": [
              "My position at Grind Web Studio was to develop the front end of e-commerce websites.",
              "Participated in the development of the interface in 5 separate projects. Developed and maintained a file management system for a company's client.",
              "Developed over 10 custom features with vanilla Javascript and converted them to NPM packages.",
              "Led the development of a platform with preconfigured reusable components, enabling the company to reduce the time needed for the development of e-commerce websites by 50%.",
              "Javascript, Wordpress, Laravel, Sass"
            ]
          },
          {
            "title": "Max Win Gaming",
            "subTitle": "Software Developer | December, 2017 - October, 2019",
            "text": [
              "At Max Win Gaming I was working on slot game mechanics and animations.",
              "The games were developed using HTML Canvas and EaselJS - a JS library for animations. In order to guarantee captivating game graphics, my position required proficiency with Adobe Photoshop, After Effects, and Animate.",
              "All team members, including myself, participated in every phase of the game production process - from the product development stage to digital marketing design, and localization.",
              "After I gained expertise in the technology, I introduced new methods for the development of the games which greatly improved the productivity of the team. Some of these techniques are still used by the organization as standard operating procedures.",
              "Javascript, EaselJS, Adobe Suite"
            ]
          },
          {
            "title": "Self-employeed",
            "subTitle": "Freelance Digital Designer | October, 2014 - November, 2021",
            "text": [
              "My experience in design spans through multiple fields.",
              "I started working as a freelance graphic designer for about 5 years, where I took on projects for book covers, posters, marketing materials for physical advertising, and social media.",
              "Through my clients' recommendations, I was approached for digital design work, which I took upon and expanded my experience in this field too. I've developed the designs of several websites and apps.",
              "For the development of an e-commerce website, I was responsible for the management of the design team as well as monitoring other processes in the project.",
              "I was also hired by a client to maintain social media accounts by creating advertisements, videos, animations, and graphics for blog posts and marketing campaigns.",
              "Some projects required work on animations for custom loading screens, advanced UI interactions, and illustrations.",
              "I've participated in the production of short videos for digital marketing campaigns both in pre-production and post-production.",
              "Figma, Adobe Xd, Photoshop, Illustrator, Premiere Pro, Animate CC, After Effects, DaVinci Resolve, 3ds Max, Blender"
            ]
          }
        ]
      }
    }
  ]
}