{
  "about": [
    [
      {
        "title": "Birthday",
        "text": "July 22, 2001"
      },
      {
        "title": "Location",
        "text": "Sofia, Bulgaria"
      },
      {
        "title": "Email",
        "text": "kaloyantsenkulovski.cv@gmail.com"
      }
    ]
  ],
  "navigation": {
    "info": {
      "picture": "./assets/profile.png",
      "name": "Kaloyan Tsenkulovski",
      "position": "Front-End Developer"
    },
    "social": [
      {
        "name": "github",
        "link": "https://github.com/Kaloiann"
      },
      {
        "name": "linkedin",
        "link": "https://www.linkedin.com/in/kaloyan-tsenkulovski"
      }
    ],
    "pageNavigation": [
      {
        "name": "About",
        "href": "#about"
      },
      {
        "name": "Experience",
        "href": "#experience"
      },
      {
        "name": "Portfolio",
        "href": "#portfolio"
      },
      {
        "name": "Skills",
        "href": "#skills"
      }
    ],
    "websiteNavigation": [
      {
        "name": "Resume",
        "to": "/resume",
        "icon": "link",
        "id": "resume"
      },
      {
        "name": "CV",
        "to": "/cv",
        "icon": "link"
      },
      {
        "name": "Personal Website",
        "to": "/",
        "icon": "link"
      }
    ]
  },
  "experience": [
    {
      "title": "Indepth Solutions",
      "subTitle": "Front End Developer | November, 2021 - PRESENT",
      "text": [
      "I developed e-commerce platforms with WordPress, utilizing Sass, JavaScript, and Laravel blades. My responsibilities included building pixel-perfect pages, adding custom data fields to the WordPress admin panel, optimizing device and browser compatibility, and creating unique functionalities using vanilla JavaScript.",
      "I've worked on various web development projects, demonstrating dedication to producing high-quality results through successful collaborations with diverse clients. I have a proven history of understanding client requirements, transforming them into actionable plans, and executing projects with precision. Through clear communication and attention to detail, I prioritize client satisfaction while meeting project timelines. This has honed my adaptability, problem-solving abilities, and the skill for delivering outstanding results in dynamic and fast-paced settings."
      ]
    }
  ],
  "skills": [
    {
      "title": "Tailwind",
      "text": [
        "Since 2022, I've always used Tailwind in my projects. It's super simple and clear, making my work a lot easier. Tailwind's customization options are handy, allowing me to tweak things to fit each project perfectly."
      ]
    },
    {
      "title": "Javascript",
      "text": [
        "In my ongoing projects, JavaScript is my reliable choice. Its dynamic nature simplifies coding tasks, making the development process straightforward and efficient. Whether dealing with the DOM, managing asynchronous operations, or creating interactive features, JavaScript proves invaluable in meeting the specific demands of each project."
      ]
    },
    {
      "title": "React & Next JS",
      "text": [
        "I'm utilizing React as a swift solution over Vanilla JavaScript, drawn to its component-based architecture and efficient state management. The modular nature of React components provides a clean and organized structure to my projects",
        "Recently, I've seamlessly integrated Next.js into the stack. This addition enhances the development process further with server-side rendering capabilities, optimizing page loads and bolstering overall performance."
      ]
    },
    {
      "title": "Web Development",
      "text": [
        "I possess a solid understanding of web development intricacies. From managing cookies, load balancing, and distinguishing Local Storage from Session Storage to navigating client-side and server-side JavaScript. My expertise extends to server-side rendering, client-side rendering, and performance optimization. Adhering to best practices like KISS, and DRY principles."
      ]
    },
    {
      "title": "Business Solutions",
      "text": [
        "I use my business experience gained from co-founding a company to identify more efficient solutions for engineering challenges that directly affect the overall performance of the business.",
        "This experience has also sharpened my ability to prioritize tasks effectively and discern their levels of urgency. Also understanding the goals and challenges of colleagues across various departments has notably enhanced my communication skills within the team."
      ]
    }
  ],
  "portfolio": [
    {
      "title": "Web Development",
      "content": [
        {
          "title": "BMI Bulgaria- Roof installations information and catalog",
          "href": "https://www.bmigroup.com/bg/",
          "techStack": [
            {
              "title": "Javascript"
            },
            {
              "title": "jQuery"
            },
            {
              "title": "Laravel"
            },
            {
              "title": "Tailwind"
            }
          ]
        },
        {
          "title": "Kaiski - Web site for an artist with custom  CMS",
          "href": "https://www.kaiski.com/",
          "techStack": [
            {
              "title": "Next JS"
            },
            {
              "title": "Firebase"
            },
            {
              "title": "Tailwind"
            }
          ]
        },
        {
          "title": "Biotrade Corporate website - Interactive Map",
          "href": "https://biotrade.global/",
          "techStack": [
            {
              "title": "Javascript (Vanilla)"
            },
            {
              "title": "Laravel"
            },
            {
              "title": "Wordpress (with ACF)"
            }
          ]
        }
      ]
    }
  ]
}